app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @search = User.search(params[:q])

INSERT INTO "users" ("name", "age", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "user1"], ["age", 20], ["note", "test"], ["created_at", "2020-06-07 10:44:00.932425"], ["updated_at", "2020-06-07 10:44:00.932425"]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save